Repository: twobob/wireshark
Catalog: packaging/debian/po/*.po
Languages: id

source: Should non-superusers be able to capture packets?
id: Apakah pengguna non-superuser dapat menangkap paket?

source: Dumpcap can be installed in a way that allows members of the "wireshark" system group to capture packets. This is recommended over the alternative of running Wireshark/Tshark directly as root, because less of the code will run with elevated privileges.
id: Dumpcap dapat dipasang dengan suatu cara yang memungkinkan anggota dari grup sistem "wireshark" untuk menangkap paket. Hal ini dianjurkan sebagai alternatif untuk menjalankan Wireshark/Tshark secara langsung sebagai root, karena lebih sedikit kode yang berjalan dengan hak yang ditingkatkan.

source: For more detailed information please see /usr/share/doc/wireshark-common/README.Debian.
id: Untuk informasi lebih rinci silakan lihat /usr/share/doc/wireshark-common/README.Debian.

source: Enabling this feature may be a security risk, so it is disabled by default. If in doubt, it is suggested to leave it disabled.
id: Mengaktifkan fitur ini akan dapat menyebabkan resiko keamanan, jadi secara bawaan akan dinon-aktifkan. Jika ragu, disarankan untuk membiarkan itu nonaktif.

source: Creating the wireshark system group failed
id: Pembuatan grup sistem wireshark gagal

source: The wireshark group does not exist, and creating it failed, so Wireshark cannot be configured to capture traffic as an unprivileged user.
id: Grup wireshark tidak ada, dan penciptaannya gagal, sehingga Wireshark tidak dapat dikonfigurasi untuk menangkap lalu lintas sebagai seorang pengguna tanpa hak khusus.

source: Please create the wireshark system group and try configuring wireshark-common again.
id: Harap buat grup sistem wireshark dan cobalah mengonfigurasi wireshark-common lagi.

source: The wireshark group is a system group
id: Grup wireshark adalah sebuah grup sistem

source: The wireshark group exists as a user group, but the preferred configuration is for it to be created as a system group.
id: Grup wireshark ada sebagai sebuah grup pengguna, tapi konfigurasi yang disukai adalah agar itu dibuat sebagai sebuah grup sistem.

source: As a result, purging wireshark-common will not remove the wireshark group, but everything else should work properly.
id: Sebagai hasilnya, menghapus tuntas wireshark-common tidak akan menghapus grup wireshark, tapi semua yang lain seharusnya bekerja dengan benar.

source: Setting capabilities for dumpcap failed
id: Penataan kapabilitas bagi dumpcap gagal

source: The attempt to use Linux capabilities to grant packet-capturing privileges to the dumpcap binary failed. Instead, it has had the set-user-id bit set.
id: Upaya untuk memakai kapabilitas Linux untuk memberikan hak menangkap paket ke biner dumpcap gagal. Sebagai pengganti, itu telah menata bit set-user-id.

source: Removal of the wireshark group failed
id: Penghapusan grup wireshark gagal

source: When the wireshark-common package is configured to allow non-superusers to capture packets the postinst script of wireshark-common creates the wireshark group as a system group.
id: Ketika paket wireshark-common dikonfigurasi untuk mengizinkan bukan pengguna super menangkap paket, skrip postinst dari wireshark-common membuat grup wireshark sebagai suatu grup sistem.

source: However, on this system the wireshark group is a user group instead of being a system group, so purging wireshark-common did not remove it.
id: Namun, pada sistem ini grup wireshark adalah suatu grup pengguna, bukan sebuah grup sistem, sehingga menghapus tuntas wireshark-common tidak menghapusnya.

source: If the group is no longer needed, please remove it manually.
id: Bila grup tersebut tidak diperlukan lagi, harap hapus secara manual.

source: Should non-superusers be able to capture system calls?
id: Apakah yang bukan pengguna super dapat menangkap panggilan sistem?

source: The falcodump external capture utility (extcap) can be installed in a way that allows members of the "_scap" system group to capture system calls. This is recommended over the alternative of running Stratoshark directly as root, because less of the code will run with elevated privileges.
id: Utilitas penangkapan eksternal (extcap) falcodump dapat dipasang dengan cara yang memungkinkan anggota dari grup sistem "_scap" menangkap pemanggilan sistem. Ini lebih direkomendasikan daripada alternatif menjalankan Stratoshark secara langsung sebagai root, karena lebih sedikit kode yang akan dijalankan dengan hak yang ditingkatkan.

source: Creating the "_scap" system group failed
id: Pembuatan grup sistem "_scap" gagal

source: The "_scap" group does not exist, and creating it failed, so Stratoshark cannot be configured to capture system calls as an unprivileged user.
id: Grup "_scap" tidak ada, dan upaya membuatnya gagal, sehingga Stratoshark tidak bisa dikonfigurasi untuk menangkap panggilan sistem sebagai pengguna tanpa hak khusus.

source: Please create the "_scap" system group and try configuring stratoshark again.
id: Silakan buat grup sistem "_scap" dan cobalah mengonfigurasi stratoshark lagi.

source: The "_scap" group is a system group
id: Grup "_scap" adalah sebuah grup sistem

source: The "_scap" group exists as a user group, but the preferred configuration is for it to be created as a system group.
id: Grup "_scap" ada sebagai sebuah grup pengguna, tapi konfigurasi yang disukai adalah agar itu dibuat sebagai sebuah grup sistem.

source: As a result, purging stratoshark will not remove the "_scap" group, but everything else should work properly.
id: Akibatnya, membuang habis stratoshark tidak akan mengubah grup "_scap", tetapi semua yang lain mestinya bekerja dengan benar.
